In [99]:
#Importing relevant libraries
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns
plt.style.use('ggplot')

In [100]:
data = pd.read_csv('KPMG_CustomerAddress.csv')

In [101]:
# checking the number of rows and columns in the dataset
data.shape

(3999, 6)

In [102]:
#To view the first(.head) and last(.tail) inputs. you can also specify the number of entry to view
#pd.set_option("max_row",500)
data.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [103]:
#To view all the columns
data.columns

Index(['customer_id', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

In [104]:
#Understanding the data type of each column
data.dtypes

customer_id            int64
address               object
postcode               int64
state                 object
country               object
property_valuation     int64
dtype: object

In [105]:
# Viewing the numerical/ statistical info
data.describe()

       customer_id     postcode  property_valuation
count  3999.000000  3999.000000         3999.000000
mean   2003.987997  2985.755939            7.514379
std    1154.576912   844.878364            2.824663
min       1.000000  2000.000000            1.000000
25%    1004.500000  2200.000000            6.000000
50%    2004.000000  2768.000000            8.000000
75%    3003.500000  3750.000000           10.000000
max    4003.000000  4883.000000           12.000000

In [106]:
# Renaming the columns using dictionaries. Capitalizing the first letters
data= data.rename(columns ={'customer_id': 'Customer_ID', 'address':'Address', 'postcode':'Postcode', 'state':'State', 'country':'Country',
       'property_valuation':'Property_Valuation'})

In [107]:
data

,Customer_ID,Address,Postcode,State,Country,Property_Valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9
...,...,...,...,...,...,...
3994,3999,1482 Hauk Trail,3064,VIC,Australia,3
3995,4000,57042 Village Green Point,4511,QLD,Australia,6
3996,4001,87 Crescent Oaks Alley,2756,NSW,Australia,10
3997,4002,8194 Lien Street,4032,QLD,Australia,7
3998,4003,320 Acker Drive,2251,NSW,Australia,7

In [108]:
data['State']

0       New South Wales
1       New South Wales
2                   QLD
3       New South Wales
4                   VIC
             ...
3994                VIC
3995                QLD
3996                NSW
3997                QLD
3998                NSW
Name: State, Length: 3999, dtype: object

In [109]:
#Renaming Victoria to VIC and New South Wales. 82 and 86 changes were made respectively
data['State'] = data['State'].replace({'Victoria': 'VIC','New South Wales': 'NSW' })

In [110]:
# No missing values
data.isnull().sum()

Customer_ID           0
Address               0
Postcode              0
State                 0
Country               0
Property_Valuation    0
dtype: int64

In [114]:
# Check for Duplicate values
data.loc[data.duplicated(subset = ['Customer_ID', 'Address', 'Postcode'])].sum()

Customer_ID           0.0
Address               0.0
Postcode              0.0
State                 0.0
Country               0.0
Property_Valuation    0.0
dtype: float64

Empty DataFrame
Columns: [Customer_ID, Address, Postcode, State, Country, Property_Valuation]
Index: []